#### Terraform Format and Style 🖌: `success`
#### Terraform Initialization ⚙️: `success`
#### Terraform Validation 🤖: `success`
#### Terraform Plan 📖: `success`

<details><summary>Show Plan</summary>

```

[command]/home/runner/work/_temp/5f0c9a04-797b-4d41-8447-ddfa1cd53e21/terraform-bin plan -no-color
aws_iam_user.test_role: Refreshing state... [id=test_user]
aws_iam_user_policy.test_s3: Refreshing state... [id=test_user:test]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_apprunner_service.datadog_agent_service will be created
  + resource "aws_apprunner_service" "datadog_agent_service" {
      + arn                            = (known after apply)
      + auto_scaling_configuration_arn = (known after apply)
      + id                             = (known after apply)
      + service_id                     = (known after apply)
      + service_name                   = "datadog-agent-service"
      + service_url                    = (known after apply)
      + status                         = (known after apply)
      + tags_all                       = (known after apply)

      + source_configuration {
          + auto_deployments_enabled = true

          + image_repository {
              + image_identifier      = "245918101727.dkr.ecr.eu-west-3.amazonaws.com/dd-test:latest"
              + image_repository_type = "ECR"
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + datadog_service_arn = (known after apply)

──────────────────────────────────────────────�

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @gnublin, Action: `pull_request`, Workflow: `Run Terraform checks`*